# üóùÔ∏è Pandas DataFrame Element Access

#### ¬ª Import the Pandas and Numpy libraries

In [1]:
import pandas as pd
import numpy as np

#### ¬ª Create 2D random integer array using Numpy

In [2]:
m = np.random.randint(5,30, size=(5,3))
m

array([[20, 24, 24],
       [28, 18, 27],
       [ 8, 19, 16],
       [17, 18,  5],
       [21, 26, 11]])

#### ¬ª Create a DataFrame from the array and assigning column names

In [3]:
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])
df

   var1  var2  var3
0    20    24    24
1    28    18    27
2     8    19    16
3    17    18     5
4    21    26    11

#### ¬ª Access a single column

In [4]:
df["var1"]

0    20
1    28
2     8
3    17
4    21
Name: var1, dtype: int64

#### ¬ª Access columns (returns DataFrame)

In [5]:
df[["var1", "var2"]]

   var1  var2
0    20    24
1    28    18
2     8    19
3    17    18
4    21    26

#### ¬ª Access a row using slicing (returns DataFrame)

In [6]:
df[0:1]

   var1  var2  var3
0    20    24    24

#### ¬ª Row selection using .loc (label-based, inclusive of stop index) -> `dataframe.loc[start:stop]`

In [7]:
df.loc[0:3] #Includes row 3

   var1  var2  var3
0    20    24    24
1    28    18    27
2     8    19    16
3    17    18     5

#### ¬ª Row selection using .iloc (position-based, excludes stop index) -> `dataframe.iloc[start:stop]`

In [8]:
df.iloc[0:3] #Includes only rows at position 0, 1, 2

   var1  var2  var3
0    20    24    24
1    28    18    27
2     8    19    16

In [9]:
df[0:3] #same as df.iloc[0:3]

   var1  var2  var3
0    20    24    24
1    28    18    27
2     8    19    16

#### ¬ª Access a single value using .iloc -> `dataframe.iloc[row,column]`

In [10]:
df.iloc[0,0]

np.int64(20)

#### ¬ª Access a single row by index -> `dataframe.iloc[index]`

In [11]:
df.iloc[0]

var1    20
var2    24
var3    24
Name: 0, dtype: int64

#### ¬ª Access specific row and column ranges using indices -> `dataframe.iloc[row_start:row_end, [column_indices]]`

In [12]:
df.iloc[1:4, [0, 2]]

   var1  var3
1    28    27
2     8    16
3    17     5

#### ¬ª Access specific column values from a row range using .loc -> `dataframe.loc[start:stop, label]`

In [13]:
df.loc[0:3, "var3"]

0    24
1    27
2    16
3     5
Name: var3, dtype: int64

#### ¬ª Access specific column values from a row range using slicing -> `dataframe[start:stop][label]`
‚ö†Ô∏è This is called *chained indexing* and may not be recommended for assignments.

In [14]:
df[0:3]["var3"]

0    24
1    27
2    16
Name: var3, dtype: int64

#### ¬ª Access multiple columns from a row range using chained indexing -> `dataframe[start:stop][[l1,l2,..]]`
üí° Prefer: `dataframe.loc[start:stop, [l1,l2,..]]`

In [15]:
df[0:3][["var3", "var2"]]

   var3  var2
0    24    24
1    27    18
2    16    19

In [16]:
df.loc[0:2, ["var3","var2"]]

   var3  var2
0    24    24
1    27    18
2    16    19